<template>
  <h2>版权声明（Copyright Notice）</h2>

  <p>版权所有 © [2024] [黄艳鹏]</p>

  <p>本开源项目由 [黄艳鹏] 开发，现以MPL-2.0许可协议发布。</p>

  <h3>许可协议（License）</h3>

  <p style="text-indent: 20px">本项目的源代码可以在MPL-2.0许可协议下使用。主要条款如下：</p>

  <ol>
    <li>个人或组织可以免费使用、复制和修改本项目的源代码。</li>
    <li>禁止将本项目的源代码或修改后的代码用于任何形式的商业用途，包括但不限于售卖、租赁或其他形式的盈利活动。</li>
    <li>禁止分发本项目的源代码或修改后的代码给第三方。</li>
  </ol>

  <h3>免责声明（Disclaimer）</h3>

  <p style="text-indent: 20px">本项目的源代码按“现状”提供，使用者需自行承担使用风险。在任何情况下，原作者或版权持有者对因使用本项目源代码而产生的任何直接、间接、附带、特殊、惩罚性或后果性的损害不承担责任。</p>

</template>
<script setup lang="ts">
</script>